<?php

$lang['download_pdf'] = "Изтегляне като PDF";
$lang['pdf_name'] = "Веселин Николов - Персонална страница.pdf";
$lang['page_title'] = "Веселин Николов - Персонална страница";
$lang['menu_short'] = "Накратко";
$lang['menu_experience'] = "Опит";
$lang['menu_education'] = "Образование";
$lang['menu_skills'] = "Умения";
$lang['menu_soft_skills'] = "Личностни умения";
$lang['menu_awards'] = "Отличия";
$lang['name'] = "Веселин";
$lang['lastname'] = "Николов";
$lang['intro'] = "Аз съм мотивиран млад IT специалист и софтуерен инженер, целящ да се развива в технологичната сфера. В момента съм на ".$age." години, а последните ".$experience." от тях съм прекарал в активни IT занимания. Зная отличен английски език. Хобитата ми включват електротехника, механика и автомобили, аудио техника и диджейство.";
$lang['extracurricular_activity'] = "Извънкласна дейност";
$lang['extracurricular_activity_body_first'] = 'По време на цялото си гимназиално образование, аз участвах ежегодно в <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a> с разнообразни проекти и разработки, като при първото ми участие ми бе връчен сребърен медал. Също така взех и участие в <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> през 2017 година и бях поставен на първо място в категорията си. По време на участията си получих и други отличия.';
$lang['extracurricular_activity_body_second'] = 'Този период беше много ценен и за моите комуникативни умения, както с някои от учителите, които често се допитваха до мен за техническа помощ и съвети, така и с новодошлите всяка година ученици в ИТ отбора в училище, които най-често аз въвеждах в програмирането. Вземах и активно участие в теоретичната им подготовка. Това ме научи да работя с по-неопитни хора от мен и да изразявам сложни принципи по разбираем начин.';
$lang['noit'] = "НОИТ";
$lang['january'] = "Януари";
$lang['february'] = "Февруари";
$lang['march'] = "Март";
$lang['april'] = "Април";
$lang['may'] = "Май";
$lang['june'] = "Юни";
$lang['july'] = "Юли";
$lang['august'] = "Август";
$lang['september'] = "Септември";
$lang['october'] = "Октомври";
$lang['november'] = "Ноември";
$lang['december'] = "Декември";
$lang['web_developer'] = "Уеб разработчик";
$lang['freelance'] = "На свободен принцип";
$lang['freelance_experience'] = "През лятото на 2016 година се почувствах достатъчно уверен в себе си, че да се опитам да предложа услуги на freelance пазара. През този период разработих wordpress фирмен сайт, един относително голям проект с PHP/Codeigniter и един онлайн магазин, базиран на Python/Django. Предвид условията, при които работех, не мога да разкрия повече детайли за проектите.";
$lang['pluni'] = 'Пловдивски университет "Паисий Хилендарски"';
$lang['software_engineering'] = "Софтуерно инженерство";
$lang['software_engineering_desc'] = 'Вече мога да нарека себе си и студент в <a href="https://uni-plovdiv.bg/" target="_blank">Пловдивски университет</a> със специалност <a href="https://uni-plovdiv.bg/pages/index/1131/" target="_blank">Софтуерно инженерство</a>(задочно).';
$lang['current_moment'] = "Настоящия момент";
$lang['pgi'] = "Професионална гимназия по икономика - гр. Перник";
$lang['pgi_h1'] = "Икономическа информатика";
$lang['pgi_h2'] = "Извънкласни дейности - уеб и мобилна разработка";
$lang['pgi_desc'] = 'В <a href="http://pgi-pernik.bg-schools.com" target="_blank">ПГИ</a> интересът ми към ИТ се превърна в професионална насока. По време на обучението ми там, училището се изяви като водеща ИТ гимназия в Перник, за което моята отдаденост през тези години допринесе значително.';
$lang['soupberon'] = "СОУ „Д-р Петър Берон”";
$lang['soupberon_h1'] = "Основно образование";
$lang['soupberon_desc'] = 'Най-ценното нещо, което получих по време на основното ми образование в <a href="http://www.soupetarberon.info/" target="_blank">СУ с разширено изучаване на чужди езици „Д-р Петър Берон”</a> е добро познание на английски език, както и основно ниво руски език. Също така там направих първите крачки към изучаването на HTML.';
$lang['awards_2014_desc'] = 'През 2014г. на <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a> беше първата ми изява в ИТ сферата. Моят проект <a target="_blank" href="http://oureurope.bg-schools.com">Нашата Европа</a> беше поставен на трето място в категория "Уеб сайт", което в комбинация с достойното ми представяне и на теоретичния изпит, спомогна да бъда поставен на второ място в генералното класиране.';
$lang['awards_2017_noit'] = 'Много успешна година за мен бе 2017. Успехите стартираха с отличното ми представяне на <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a>, с проекта <a target="_blank" href="https://play.google.com/store/apps/details?id=eu.noit.remindme">Подсети ме!</a>, който беше първата ми по-сериозна среща с андроид разработката като цяло. Той бе поставен на шесто място в категорията "приложни програми", което в комбинация с отличното ми представяне на теоретичния тест, ми донесе оценка 6.00.';
$lang['awards_2017_konkurs'] = 'Успехът ми на националната олимпиада ми осигури покана за <a href="https://www.president.bg/cat37/Nagrada-Jonh-Atanasov/" target="_blank">конкурса за награда "Джон Атанасов"</a>, организиран от администрацията на Президента на Република България.';
$lang['awards_2017_net'] = 'Най-успещната си година завърших с първо място на <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> с проекта "ChildStatus". Той все още търпи активна разработка, което е и причината да не е публикуван никъде. Накратко проектът представлява начин родителите да питат за "статуса" на децата си с допълнителни опции за ситуации с висок приоритет и други. Ако се интересувате от проекта, може да прегледате <a href="media/childstatus.pptx">презентацията</a>.';

$lang['skill_cats'] = [
	'frontend' => [
		'title' => "Frontend езици и инструменти",
		'skills' => $skills_frend
	],
	'backend' => [
		'title' => "Backend езици и инструменти",
		'skills' => $skills_bend
	],
	'other' => [
		'title' => "Други",
		'skills' => $skills_other
	],
];

$lang['soft_skills'] = [
	[
		'h' => "Говорене пред хора и презентиране",
		'desc' => "През петте години ежегодно участие в НОИТ, аз съм развил умението да говоря пред хора и да представям проекти и идеи пред публика, като мога да приложа различен стил на представяне в съответствие с конкретната публиката.",
	],
	[
		'h' => "Лидерски качества",
		'desc' => "Смея да твърдя, че имам лидерски качества. Мога да забележа кой в какво е добър и да разпределя ефективно задачите в отбор от хора.",
	],
	[
		'h' => "Комуникативен",
		'desc' => 'Напоследък често ми се случва да ме определят като "народен човек". Мога да се разбирам с различни хора по различни теми.',
	],
	[
		'h' => "Работа под напрежение",
		'desc' => "Умея да работя ефективно и експедитивно в напрегнати ситуации и под стрес, но намирам работа в подобни условия за прекалено изтощителна и предпочитам да страня от такава.",
	],
	[
		'h' => "Уча бързо",
		'desc' => 'Имам така наречената "инженерна мисъл", което ми позволява да разучавам бързо нови технологии и механизми, както и да приспособявам стари такива като решения на възникнали проблеми и ситуации.',
	],
	[
		'h' => "Добър учител",
		'desc' => 'В началото бях много скептичен относно преподавателските и лекторските си умения, но обратна връзка от хора, които съм обучавал докато бях в ПГИ, промени самооценката ми. По-малки ученици и мои връстници твърдят, че представям сложни принципи по разбираем начин.',
	],
	[
		'h' => "Работа в екип",
		'desc' => 'Докато бях в гимназията, работих по проекти с други членове на ИТ екипа постоянно. Някои по-опитни, други по-неопитни.',
	],
];