<?php

$lang['download_pdf'] = "Изтегляне като PDF";
$lang['pdf_name'] = "Веселин Николов - Персонална страница.pdf";
$lang['page_title'] = "Веселин Николов - Персонална страница";
$lang['menu_short'] = "Накратко";
$lang['menu_experience'] = "Опит";
$lang['menu_education'] = "Образование";
$lang['menu_skills'] = "Умения";
$lang['menu_soft_skills'] = "Личностни умения";
$lang['menu_awards'] = "Отличия";
$lang['name'] = "Веселин";
$lang['lastname'] = "Николов";
$lang['intro'] = "Аз съм мотивиран млад IT специалист и софтуерен инженер, целящ да се развива в технологичната сфера. В момента съм на %d години, а последните %d от тях съм прекарал в активни IT занимания. Зная отличен английски език. Хобитата ми включват електротехника, механика и автомобили, аудио техника и диджейство.";
$lang['extracurricular_activity'] = "Извънкласна дейност";
$lang['extracurricular_activity_body_first'] = 'По време на цялото си гимназиално образование, аз участвах ежегодно в <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a> с разнообразни проекти и разработки, като при първото ми участие, ми бе връчен сребърен медал. Също така, взех участие и в <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> през 2017 година и бях поставен на първо място в категорията си. По време на участията си получих и други отличия.';
$lang['extracurricular_activity_body_second'] = 'Този период беше много ценен и за моите комуникативни умения, както с някои от учителите, които често се допитваха до мен за техническа помощ и съвети, така и с новодошлите всяка година ученици в ИТ отбора в училище, които най-често аз въвеждах в програмирането. Вземах и активно участие в теоретичната им подготовка. Това ме научи да работя с по-неопитни хора от мен и да изразявам сложни принципи по разбираем начин.';
$lang['zoiper'] = "Zoiper";
$lang['zoiper_position'] = "Android & JavaScript developer";
$lang['zoiper_body'] = 'Понастоящем работя в <a href="https://zoiper.com/" target="_blank">Zoiper</a> като част от Android екипа на компанията. С колегите ми работим за да поддържаме и актуализираме нашият <a href="https://play.google.com/store/apps/details?id=com.zoiper.android.app" target="_blank">VOIP клиент за Android</a>. Поради вече наличният ми опит с JavaScript, напоследък се включвам активно и към такъв тип проекти в компанията.';
$lang['noit'] = "НОИТ";
$lang['january'] = "Януари";
$lang['february'] = "Февруари";
$lang['march'] = "Март";
$lang['april'] = "Април";
$lang['may'] = "Май";
$lang['june'] = "Юни";
$lang['july'] = "Юли";
$lang['august'] = "Август";
$lang['september'] = "Септември";
$lang['october'] = "Октомври";
$lang['november'] = "Ноември";
$lang['december'] = "Декември";
$lang['web_developer'] = "Уеб разработчик";
$lang['freelance'] = "На свободен принцип";
$lang['freelance_experience'] = "През лятото на 2016 година се почувствах достатъчно уверен в себе си, че да се опитам да предложа услуги на freelance пазара. През този период разработих wordpress фирмен сайт, един относително голям проект с PHP/Codeigniter и един онлайн магазин, базиран на Python/Django. Предвид условията, при които работех, не мога да разкрия повече детайли за проектите.";
$lang['pluni'] = 'Пловдивски университет "Паисий Хилендарски"';
$lang['software_engineering'] = "Софтуерно инженерство";
$lang['software_engineering_desc'] = 'Изучавам <a href="https://uni-plovdiv.bg/pages/index/1131/" target="_blank">Софтуерно инженерство</a>(задочна форма) в <a href="https://uni-plovdiv.bg/" target="_blank">Пловдивски университет</a>.';
$lang['current_moment'] = "Настоящия момент";
$lang['pgi'] = "Професионална гимназия по икономика - гр. Перник";
$lang['pgi_h1'] = "Икономическа информатика";
$lang['pgi_h2'] = "Извънкласни дейности - уеб и мобилна разработка";
$lang['pgi_desc'] = 'В <a href="http://pgi-pernik.bg-schools.com" target="_blank">ПГИ</a> интересът ми към ИТ се превърна в професионална насока. По време на обучението ми там, училището се изяви като водеща ИТ гимназия в Перник, за което моята отдаденост през тези години допринесе значително.';
$lang['soupberon'] = "СОУ „Д-р Петър Берон”";
$lang['soupberon_h1'] = "Основно образование";
$lang['soupberon_desc'] = 'Най-ценното нещо, което получих по време на основното ми образование в <a href="https://www.suberon-pernik.com/" target="_blank">СУ с разширено изучаване на чужди езици „Д-р Петър Берон”</a> е добро познание на английски език, както и основно ниво руски език. Също така там направих първите крачки в изучаването на HTML.';
$lang['awards_2014_desc'] = 'През 2014г. на <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a> беше първата ми изява в ИТ сферата. Моят проект <a target="_blank" href="http://oureurope.bg-schools.com">Нашата Европа</a> беше поставен на трето място в категория "Уеб сайт", което в комбинация с достойното ми представяне и на теоретичния изпит, спомогна да бъда поставен на второ място в генералното класиране.';
$lang['awards_2017_noit'] = 'Много успешна година за мен бе 2017. Успехите стартираха с отличното ми представяне на <a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank">НОИТ</a>, с проекта <a target="_blank" href="https://play.google.com/store/apps/details?id=eu.noit.remindme">Подсети ме!</a>, който беше първата ми по-сериозна среща с андроид разработката като цяло. Той бе поставен на шесто място в категорията "приложни програми", което в комбинация с отличното ми представяне на теоретичния тест, ми донесе оценка 6.00.';
$lang['awards_2017_konkurs'] = 'Успехът ми на националната олимпиада ми осигури покана за <a href="https://www.president.bg/cat37/Nagrada-Jonh-Atanasov/" target="_blank">конкурса за награда "Джон Атанасов"</a>, организиран от администрацията на Президента на Република България.';
$lang['awards_2017_net'] = 'Най-успещната си година завърших с първо място на <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> с проекта "ChildStatus". Той все още търпи активна разработка, което е и причината да не е публикуван никъде. Накратко проектът представлява начин родителите да питат за "статуса" на децата си с допълнителни опции за ситуации с висок приоритет и други. Ако се интересувате от проекта, може да прегледате <a href="media/childstatus.pptx">презентацията</a>.';

$lang['soft_skills'] = [
	[
		'h' => "Говорене пред хора и презентиране",
		'desc' => "През петте години ежегодно участие в НОИТ, аз съм развил умението да говоря пред хора и да представям проекти и идеи пред публика, като мога да приложа различен стил на представяне в съответствие с конкретната публиката.",
	],
	[
		'h' => "Способност да обобщавам",
		'desc' => "Мога да чета между редовете и да комуникирам с някого докато стигна до същината на казваното. Това умение съм намерил за най-полезно в ситуациите, когато множество хора спорят и трябва някой да обобщи аргументите на всички и да заформи мнение, отговарящо на всичките.",
	],
	[
		'h' => "Комуникативен",
		'desc' => 'Напоследък често ми се случва да ме определят като "народен човек". Мога да се разбирам с различни хора по различни теми.',
	],
	[
		'h' => "Работа под напрежение",
		'desc' => "Умея да работя ефективно и експедитивно в напрегнати ситуации и под стрес, но намирам работа в подобни условия за прекалено изтощителна и предпочитам да страня от такава.",
	],
	[
		'h' => "Уча бързо",
		'desc' => 'Имам така наречената "инженерна мисъл", което ми позволява да разучавам бързо нови технологии и механизми, както и да приспособявам стари такива като решения на възникнали проблеми и ситуации.',
	],
	[
		'h' => "Добър учител",
		'desc' => 'В началото бях много скептичен относно преподавателските и лекторските си умения, но обратна връзка от хора, които съм обучавал докато бях в ПГИ, промени самооценката ми. По-малки ученици и мои връстници твърдят, че представям сложни принципи по разбираем начин.',
	],
	[
		'h' => "Работа в екип",
		'desc' => "Мога да работя и да се разбирам с всякакви хора.",
	],
	[
		'h' => "Не се боя да попитам",
		'desc' => "Прекалено често, хората се притесняват да задават \"тъпи\" въпроси, което, въпреки че е разбираемо, води до много загубено време. Питам каквото, когато и когото е необходимо. Аз също си правя труда да се опитам да проуча нещо сам, преди да губя още нечие време, но и полагам съзнателно усилие да забелязвам моментите, когато е по-ефективно просто да попитам някой, който зная, че ще реши по-лесно и бързо проблема.",
	]
];

$lang['skills_android'] = "Наборът ми от инструменти за Android разработка включва Java, Kotlin, части от Jetpack, Dagger2, RxJava2, MVP, MVVM, Butterknife, Room, Retrofit 2, FCM, design patterns и др. Моят най-силен интерес в момента е изучаването и развиването на архитектури за оформление на Android проекти.";
$lang['skills_frontend'] = "Имам богат опит с основния frontend комплект - HTML, CSS, JS, jQuery. Това ми позволява да изградя напълно функционален frontend според поставени изисквания с тях.";
$lang['skills_reactjs'] = "Разглеждал съм и съм експериментирал с React и React Native в комбинация с Redux.";
$lang['skills_bootstrap'] = "Опитът ми с него се изразява в модификация на готови дизайни и сглобяване на компоненти от различни шаблони, за да се получи краен продукт, отговарящ на поставени изисквания.";
$lang['skills_backend'] = "Голяма част от моят опит е в backend разработката:";
$lang['skills_php'] = "Първият език, който съм учил сериозно, в него имам най-солиден практически опит - около %d години. Разработвал съм какво ли не - скриптове за data scraping, уебсайтове, скриптове за рекурсивно вадене на скрити файлове от флашка, скриптове за прехвърляне на данни между различно форматирани БД. Скриптове за нормализация на БД и други.";
$lang['skills_codeigniter'] = "С него имам разработени 2 по-сериозни проекта. Backend-ът към приложението \"Подсети ме!\" и още един проект с по-високо ниво на сложност и frontend.";
$lang['skills_twig'] = "Приликата му с templating engine на Django ми позволи да се запозная с Twig без особено затруднение.";
$lang['skills_express'] = "Вземал съм участие в разработката на продукти, където Express е сред главните технологии.";
$lang['skills_python'] = "С него се срещнах за пръв път през лятото на 2014г. Използвал съм го за сайтове, базирани на Django и Flask, интерфейси с pyqt, data scraping, machine learning и други еднократни скриптове с разнообразни цели.";
$lang['skills_javascript'] = "Императивно, обектно-ориентирано, функциоанлно.";
$lang['skills_django'] = "Познавам Django от около %d години и към днешна дата вероятно е моят go-to framework за направа на уебсайт, освен ако условията на проекта не налагат друго. С него мога да изградя от елементарен до по-сложен сайт.";
$lang['skills_mysql'] = "От %d години насам голям процент от всичките ми проекти използват MySQL. Бих описал нивото си на познание като средно. Мога да изготвя структура на БД според поставени условия. Мога да пиша по-сложни SQL заявки, включително JOIN, GROUP BY и др.";
$lang['skills_mongodb'] = "С нея съм работил относително малко, но достатъчно, че да мога бързо да навляза в среда, където се използва.";
$lang['skills_rest'] = "Разбирам концепцията и мога да я приложа при създаване на web API.";
$lang['skills_other'] = "Други";
$lang['skills_other_d'] = "Други инструменти и методологии, които познавам: ";
$lang['skills_git'] = "Използвам го в ежедневието си - commits, branches, merges, tags, gitflow workflow и други подобни, не са ми чужди.";
$lang['skills_photoshop'] = "Опитът и уменията ми с Photoshop стигат колкото да преоразмеря изображение, да изтрия фон и подобни основни операции.";
$lang['skills_wordpress'] = "Не бих нарекъл себе си експерт, но мога да се ориентирам в WordPress CMS и да свърша дадено задание.";
$lang['skills_windows'] = "Предпочитаната ми операционна система. Понастоящем за професионалната си работа използвам Linux (Kubuntu), но все още предпочитам да използвам Windows когато е възможно.";
$lang['skills_kubuntu'] = "Понастоящем използвам Kubuntu за ежедневната си работа. Не бих описал общите си Linux умения като нещо впечатляващо, но са достатъчни, за да мога да свърша всяка ежедневна задача.";
$lang['skills_jira'] = "Понастоящем използвам Jira, за да менажирам работата си. Също така я познавам и от администраторска гледна точка, тъй като съм настройвал инсталация на Jira.";
$lang['skills_crucible'] = "Умея да боравя с Crucible Code Review Tool.";
$lang['skills_docker'] = "Интересът ми към Docker се зароди сравнително скоро. За пръв път започнах да експериментирам с него на настоящето си работно място.";