<?php ob_start(); ?><a href="http://edusoft.fmi.uni-sofia.bg/" target="_blank" data-toggle="tooltip" data-placement="top" title="Национална олимпиада по Информационни технологии - най-голямото IT състезание за ученици в България.">НОИТ</a><?php $lang['NOIT_link_full'] = ob_get_clean(); ?>

<?php
$lang['download_pdf'] = "Изтегляне като PDF";
$lang['pdf_name'] = "Веселин Николов - Персонална страница.pdf";
$lang['page_title'] = "Веселин Николов - Персонална страница";
$lang['menu_short'] = "Накратко";
$lang['menu_experience'] = "Опит";
$lang['menu_education'] = "Образование";
$lang['menu_skills'] = "Умения";
$lang['menu_soft_skills'] = "Личностни умения";
$lang['menu_awards'] = "Отличия";
$lang['name'] = "Веселин";
$lang['lastname'] = "Николов";
$lang['intro'] = 'Аз съм мотивиран млад IT специалист и софтуерен инженер, целящ да се развива в технологичната сфера. В момента съм на %d години, а последните %d от тях съм прекарал в активни IT занимания, като последното и най-значително от тях е ролята ми на главен технически директор в <a href="https://graosoft.com/" target="_blank">Graosoft</a>. Зная отличен английски език. Хобитата ми включват електротехника, механика и автомобили, аудио техника и диджейство.';
$lang['extracurricular_activity'] = "Извънкласна дейност";
$lang['extracurricular_activity_body_first'] = 'По време на цялото си гимназиално образование, аз участвах ежегодно в '.$lang['NOIT_link_full'].' с разнообразни проекти и разработки, като при първото ми участие, ми бе връчен сребърен медал. Също така, взех участие и в <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> през 2017 година и бях поставен на първо място в категорията си. По време на участията си получих и други отличия.';
$lang['extracurricular_activity_body_second'] = 'Този период беше много ценен и за моите комуникативни умения, както с някои от учителите, които често се допитваха до мен за техническа помощ и съвети, така и с новодошлите всяка година ученици в ИТ отбора в училище, които най-често аз въвеждах в програмирането. Вземах и активно участие в теоретичната им подготовка. Това ме научи да работя с по-неопитни хора от мен и да изразявам сложни принципи по разбираем начин.';
$lang['zoiper'] = "Zoiper";
$lang['zoiper_position'] = "Android & JavaScript developer";
$lang['zoiper_body'] = 'Започнах официалната си професионална кариера в <a href="https://zoiper.com/" target="_blank">Zoiper</a> като част от Android екипа на компанията. С моите колеги работехме за да поддържаме и актуализираме нашият <a href="https://play.google.com/store/apps/details?id=com.zoiper.android.app" target="_blank">VOIP клиент за Android</a>.';
$lang['zoiper_body_banafo'] = 'В по-късната част от работата ми за Zoiper, заех ролята на главен разработчик за проекта <a href="https://banafo.com/" target="_blank">Banafo</a>. По време на работата там имах възможността да работя с Express JS в контекста на микорсървисна архитектура, също и с React.';
$lang['nuvolo'] = "Nuvolo";
$lang['nuvolo_position'] = "Софтуерен инженер II";
$lang['nuvolo_body'] = 'Понастоящем работя в <a href="https://www.nuvolo.com/" target="_blank">Nuvolo</a> като част от екипа, поддържащ решението за управление на портфолио недвижими имоти на компанията. Ежедневните ми задължения включват разработка и поддръжка на бизнес логика, базирана на платформата <a href="https://www.servicenow.com/" target="_blank">ServiceNow</a>, както и потребителски интерфейс, базиран на React.';
$lang['graosoft'] = "Graosoft";
$lang['graosoft_position'] = "Главен технически директор (CTO)";
$lang['graosoft_body'] = 'Работата ми в <a href="https://graosoft.com/" target="_blank">Graosoft</a> включва планиране на архитектурната насока на проекти, помагане на членове на техническия отбор, преглед и обратна връзка за технически решения, разработка, решаване на технически проблеми, автоматизация.';
$lang['noit'] = "НОИТ";
$lang['january'] = "Януари";
$lang['february'] = "Февруари";
$lang['march'] = "Март";
$lang['april'] = "Април";
$lang['may'] = "Май";
$lang['june'] = "Юни";
$lang['july'] = "Юли";
$lang['august'] = "Август";
$lang['september'] = "Септември";
$lang['october'] = "Октомври";
$lang['november'] = "Ноември";
$lang['december'] = "Декември";
$lang['web_developer'] = "Уеб разработчик";
$lang['freelance'] = "На свободен принцип";
$lang['freelance_experience'] = 'През лятото на 2016 година се почувствах достатъчно уверен в себе си, че да се опитам да предложа услуги на freelance пазара. През този период разработих wordpress <a href="https://топлоизолации.bg/" target="_blank">фирмен сайт за топлоизолации</a>, един относително голям проект с PHP/Codeigniter и един онлайн магазин, базиран на Python/Django. Предвид условията, при които работех, не мога да разкрия повече детайли за проектите.';
$lang['pluni'] = 'Пловдивски университет "Паисий Хилендарски"';
$lang['software_engineering'] = "Софтуерно инженерство";
$lang['software_engineering_desc'] = 'Притежавам бакалавърска степен със специалност <a href="https://uni-plovdiv.bg/pages/index/1131/" target="_blank">Софтуерно инженерство</a> от <a href="https://uni-plovdiv.bg/" target="_blank">'.$lang['pluni'].'</a>.';
$lang['current_moment'] = "Настоящия момент";
$lang['pgi'] = "Професионална гимназия по икономика - гр. Перник";
$lang['pgi_h1'] = "Икономическа информатика";
$lang['pgi_h2'] = "Извънкласни дейности - уеб и мобилна разработка";
$lang['pgi_desc'] = 'В <a href="http://pgi-pernik.bg-schools.com" target="_blank">ПГИ</a> интересът ми към ИТ се превърна в професионална насока. По време на обучението ми там, училището се изяви като водеща ИТ гимназия в Перник, за което моята отдаденост през тези години допринесе значително.';
$lang['soupberon'] = "СОУ „Д-р Петър Берон”";
$lang['soupberon_h1'] = "Основно образование";
$lang['soupberon_desc'] = 'Най-ценното нещо, което получих по време на основното ми образование в <a href="https://www.suberon-pernik.com/" target="_blank">СУ с разширено изучаване на чужди езици „Д-р Петър Берон”</a> е добро познание на английски език, както и основно ниво руски език. Също така там направих първите крачки в изучаването на HTML.';
$lang['awards_2014_desc'] = 'През 2014г. на '.$lang['NOIT_link_full'].' беше първата ми изява в ИТ сферата. Моят проект <a target="_blank" href="http://oureurope.bg-schools.com">Нашата Европа</a> беше поставен на трето място в категория "Уеб сайт", което в комбинация с достойното ми представяне и на теоретичния изпит, спомогна да бъда поставен на второ място в генералното класиране.';
$lang['awards_2017_noit'] = 'Много успешна година за мен бе 2017. Успехите стартираха с отличното ми представяне на '.$lang['NOIT_link_full'].', с проекта <a target="_blank" href="https://play.google.com/store/apps/details?id=eu.noit.remindme">Подсети ме!</a>, който беше първата ми по-сериозна среща с андроид разработката като цяло. Той бе поставен на шесто място в категорията "приложни програми", което в комбинация с отличното ми представяне на теоретичния тест, ми донесе оценка 6.00.';
$lang['awards_2017_konkurs'] = 'Успехът ми на националната олимпиада ми осигури покана за <a href="https://www.president.bg/cat37/Nagrada-Jonh-Atanasov/" target="_blank">конкурса за награда "Джон Атанасов"</a>, организиран от администрацията на Президента на Република България.';
$lang['awards_2017_net'] = 'Най-успещната си година завърших с първо място на <a href="https://ntit.npmg.org/" target="_blank">НЕТ "Джон Атанасов"</a> с проекта "ChildStatus". Той все още търпи активна разработка, което е и причината да не е публикуван никъде. Накратко проектът представлява начин родителите да питат за "статуса" на децата си с допълнителни опции за ситуации с висок приоритет и други. Ако се интересувате от проекта, може да прегледате <a href="media/childstatus.pptx">презентацията</a>.';

$lang['soft_skills'] = [
	[
		'h' => "Говорене пред хора и презентиране",
		'desc' => "През петте години ежегодно участие в НОИТ, аз съм развил умението да говоря пред хора и да представям проекти и идеи пред публика, като мога да приложа различен стил на представяне в съответствие с конкретната публиката.",
	],
	[
		'h' => "Способност да обобщавам",
		'desc' => "Мога да чета между редовете и да комуникирам с някого докато стигна до същината на казваното. Това умение съм намерил за най-полезно в конферентна обстановка, където трябва да бъде достигнат общ консенсус.",
	],
	[
		'h' => "Комуникативен",
		'desc' => 'Намирам общ език с всякакви хора. Комуникацията почти никога не е била проблем за мен.',
	],
	[
		'h' => "Работа под напрежение",
		'desc' => "Умея да работя ефективно и експедитивно в напрегнати ситуации и под стрес, но намирам работа в подобни условия за прекалено изтощителна и предпочитам да страня от такава.",
	],
	[
		'h' => "Уча бързо",
		'desc' => 'Имам така наречената "инженерна мисъл", което ми позволява да разучавам бързо нови технологии и механизми, както и да приспособявам стари такива като решения на възникнали проблеми и ситуации.',
	],
	[
		'h' => "Добър учител",
		'desc' => 'Обучавам и менторирам хора в по-ранни етапи на тяхната кариера от самото начало на моята. По-малки ученици и мои връстници твърдят, че представям сложни принципи по разбираеми начини.',
	],
	[
		'h' => "Работа в екип",
		'desc' => "Мога да работя и да се разбирам с всякакви хора.",
	],
	[
		'h' => "Не се боя да попитам",
		'desc' => "Прекалено често, хората се притесняват да задават \"тъпи\" въпроси, което, въпреки че е разбираемо, води до много загубено време. Питам каквото, когато и когото е необходимо. Аз също си правя труда да се опитам да проуча нещо сам, преди да губя още нечие време, но и полагам съзнателно усилие да забелязвам моментите, когато е по-ефективно просто да попитам някой, който зная, че ще реши по-лесно и бързо проблема.",
	]
];

$lang['skills_android'] = "Наборът ми от инструменти за Android разработка включва Java, Kotlin, части от Jetpack, Dagger2, RxJava2, MVP, MVVM, Butterknife, Room, Retrofit 2, FCM, design patterns и др. Имам силен интерес към изучаването и развиването на архитектурни решения за оформление на Android проекти.";
$lang['skills_frontend'] = "Имам богат опит с основния frontend комплект - HTML, CSS, JS, jQuery. Това ми позволява да изградя напълно функционален frontend според поставени изисквания с тях.";
$lang['skills_reactjs'] = "Имам богат опит с ReactJS и съм работил с него обширно.";
$lang['skills_bootstrap'] = "Опитът ми с него се изразява в модификация на готови дизайни и сглобяване на компоненти от различни шаблони, за да се получи краен продукт, отговарящ на поставени изисквания.";
$lang['skills_backend'] = "Голяма част от моят опит е в backend разработката:";
$lang['skills_php'] = 'Първият език, който съм учил сериозно, за пръв път работих с него през 2013. Разработвал съм различни системи, първата от които беше <a href="https://oureurope.bg-schools.com/" target="_blank">Нашата Европа</a> (2013). Други ситуации, където съм прилагал езика включват скриптове за data scraping, уебсайтове, скриптове за рекурсивно вадене на скрити файлове от флашка, скриптове за прехвърляне на данни между различно форматирани БД., Скриптове за нормализация на БД и други.';
$lang['skills_codeigniter'] = "С него имам разработени 2 по-сериозни проекта. Backend-ът към приложението \"Подсети ме!\", с който участвах на ".$lang['NOIT_link_full']." 2017 и още един по-сложен проект, за който не мога да разкрия повече поради NDA.";
$lang['skills_express'] = "Вземал съм участие в разработката на продукти, където Express е сред главните технологии.";
$lang['skills_python'] = "С него се срещнах за пръв път през лятото на 2014г. Използвал съм го за сайтове, базирани на Django и Flask, интерфейси с pyqt, data scraping, machine learning и други еднократни скриптове с разнообразни цели.";
$lang['skills_javascript'] = "Императивно, обектно-ориентирано, функциоанлно.";
$lang['skills_django'] = 'Изпълнявъл съм няколко проекта с Django, подходящи примери са <a href="http://analyze.noit.eu/" target="_blank">Анализирай ме!</a> (2016) и <a href="http://klimatici.топлоизолации.bg/" target="_blank">klimatici.bg</a> (2018).';
$lang['skills_mysql'] = "Голям процент от всичките ми проекти използват MySQL, познавам я добре. Мога да изготвя сложна структура на БД според поставени условия. Мога да пиша сложни SQL заявки - JOIN, GROUP BY и др.";
$lang['skills_mongodb'] = "Използвал съм я като главна база данни повече от година по време на работата ми в Zoiper.";
$lang['skills_rest'] = "Разбирам концепцията и мога да я приложа при създаване на web API.";
$lang['skills_other'] = "Други";
$lang['skills_other_d'] = "Други инструменти и методологии, с които имам опит: ";
$lang['skills_git'] = "Използвам го в ежедневието си - commits, branches, merges, tags, gitflow workflow и други подобни, не са ми чужди.";
$lang['skills_photoshop'] = "Опитът и уменията ми с Photoshop стигат колкото да преоразмеря изображение, да изтрия фон и подобни основни операции.";
$lang['skills_wordpress'] = "Не бих нарекъл себе си експерт, но мога да се ориентирам в WordPress CMS и да свърша дадено задание.";
$lang['skills_windows'] = "Предпочитаната ми операционна система. Въпреки че имам опит с ежедневна работа на Linux (Kubuntu), предпочитам да използвам Windows когато е възможно.";
$lang['skills_linux'] = "Мога комфортно да работя в Linux среда. Използвал съм такава за автоматизация на build/testing/deployment процеси, както и за ежедневна работа.";
$lang['skills_jira'] = "Понастоящем използвам Jira, за да менажирам работата си. Също така я познавам и от администраторска гледна точка, тъй като съм настройвал инсталация на Jira.";
$lang['skills_crucible'] = "Умея да боравя с Crucible Code Review Tool.";
$lang['skills_docker'] = "Мога комфортно да работя в среда с тежка утилизация на Docker. Запознат съм и с инструменти като Docker Compose и Kubernetes.";
$lang['skills_bitbucket_pipelines'] = "Инструмент, с който се запознах докато създавах автоматизирани CI/CD потоци за различни проекти в Graosoft.";
$lang['skills_snow'] = "ServiceNow";
$lang['skills_snow_description'] = '<a href="https://www.servicenow.com/" target="_blank">ServiceNow</a> е ентърпрайз платформа с широк спектър от възможности, функции и приложения. Опитът ми с нея е както следва:';
$lang['skills_snow_scoped_app_title'] = 'Разработка на приложения';
$lang['skills_snow_scoped_app_desc'] = 'Голяма част от опита ми се изразява в разработката на приложения (custom scoped applications) за платформата, главно в сектор недвижими имоти.';
$lang['skills_snow_scripting_title'] = 'Инструменти за разработка';
$lang['skills_snow_scripting_desc'] = 'Писал съм доста код за ServiceNow среди и в резултат от това съм добре запознат с основните инструменти и API, например buesiness rules, script includes, events, ACLs, Glide Server APIs, GlideSystem и други.';